---
kind: method
id: M:Autodesk.Revit.DB.FilterRule.Dispose
source: html/53795b29-5ad3-3db7-bbc3-b45f8a68fc21.htm
---
# Autodesk.Revit.DB.FilterRule.Dispose Method

Releases all resources used by the FilterRule

## Syntax (C#)
```csharp
public void Dispose()
```